&НаКлиенте
Процедура Сформировать(Команда)
	Структура = СформироватьНаСервере();
	Адрес = ПолучитьМакетСервер(Структура);      
	Файл = ПолучитьФайл(Адрес, "Макет" + ".HTML", Истина);
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСервер(Структура) 
	  ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
      ИмяФайла = ПолучитьИмяВременногоФайла();
      ТД = Новый ТекстовыйДокумент;
	  ТекстДокумента = ОбработкаОбъект.ПолучитьМакет("Макет").ПолучитьТекст();
	  ТекстДокумента = СтрЗаменить(ТекстДокумента,"['headers']",Структура.МассивКолонок);
	  ТекстДокумента = СтрЗаменить(ТекстДокумента,"['data']",Структура.МассивДанных);
      ТД.УстановитьТекст(ТекстДокумента);
      ТД.Записать(ИмяФайла);
      ДД = Новый ДвоичныеДанные(ИмяФайла);
      УдалитьФайлы(ИмяФайла);
      Возврат  ПоместитьВоВременноеХранилище(ДД, УникальныйИдентификатор);
КонецФункции 

&НаСервере
Функция СформироватьНаСервере()
	ТаблицаДанныхИзSQL = ПолучитьТаблицуДанныхИзSQL();

	КолонкиИсключения = Новый Массив;
	КолонкиИсключения.Добавить("Дата");
	КолонкиИсключения.Добавить("Вход1Выход2");
	КолонкиИсключения.Добавить("Подразделение");
	КолонкиИсключения.Добавить("Двери");
	
	СтруктураВозврата = Новый Структура;
	СтруктураТаблица = Новый Структура;
	Для каждого мКолонка Из ТаблицаДанныхИзSQL.Колонки Цикл 
		Если КолонкиИсключения.Найти(мКолонка.Имя) = Неопределено Тогда 
			НоваяТаблица = ТаблицаДанныхИзSQL.Скопировать();
			НоваяТаблица.Свернуть(мКолонка.Имя);
			СтруктураТаблица.Вставить(мКолонка.Имя,НоваяТаблица); 		
		КонецЕсли;
	КонецЦикла;
	
	МассивКолонок = "['ФИО','Дверь входа','Дата входа','Дверь выхода','Дата выхода', 'Подразделение', 'Отработал']";	
	МассивДанных = "[";
	
	Счетчик = 1;
	Для каждого ФИО из СтруктураТаблица.ФИО Цикл 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ФИО", ФИО.ФИО);
		СтрокиФИО = ТаблицаДанныхИзSQL.НайтиСтроки(ПараметрыОтбора);
		
		ФИОСотрудника = СтрокиФИО[0].ФИО;
		ДверьВхода = СтрокиФИО[0].Дверь;		
		ДатаВхода = СтрокиФИО[0].Дата;
		ДверьВыхода = СтрокиФИО[СтрокиФИО.Количество()-1].Дверь;
		ДатаВыхода = СтрокиФИО[СтрокиФИО.Количество()-1].Дата;
		Подразделение = СтрокиФИО[0].Подразделение; 
		

		Разность = Цел(ДатаВыхода-ДатаВхода); 
		ОтработалЧасов = Цел(Разность/3600);
		ОтработалЧасов = ?(СтрДлина(Строка(ОтработалЧасов))=1, "0"+ОтработалЧасов, Строка(ОтработалЧасов));
		
		ОтработалМинут = Цел((Разность % 3600) / 60);
		ОтработалМинут = ?(СтрДлина(Строка(ОтработалМинут))=1, "0"+ОтработалМинут, Строка(ОтработалМинут));

		
		ОтработалСекунд = Разность % 60;
		ОтработалСекунд = ?(СтрДлина(Строка(ОтработалСекунд))=1, "0"+ОтработалСекунд, Строка(ОтработалСекунд));
 
		Отработал = ОтработалЧасов + " час. " + ОтработалМинут + " мин. " + ОтработалСекунд + " сек.";
		
		МассивДанных = МассивДанных+"['"+ФИОСотрудника+"', '"+ДверьВхода+"', '"+ДатаВхода+"', '"+ДверьВыхода+ "', '"+ДатаВыхода+"', '"+Подразделение+"', '"+Отработал+"']";
		Если Счетчик < СтруктураТаблица.ФИО.Количество() Тогда 
			МассивДанных = МассивДанных + ",";
		Иначе
			МассивДанных = МассивДанных + "]";
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	//Структура = Новый Структура;
	//
	//Если ТаблицаДанныхИзSQL.Колонки.Количество() > 0 Тогда 
	//	МассивКолонок = "[";
	//	Для i = 0 по ТаблицаДанныхИзSQL.Колонки.Количество()-1 Цикл
	//		ИмяКолонки = ТаблицаДанныхИзSQL.Колонки[i].Имя;
	//		МассивКолонок = МассивКолонок + "'" + ИмяКолонки + "'";
	//		Если i = ТаблицаДанныхИзSQL.Колонки.Количество()-1 Тогда 
	//			МассивКолонок = МассивКолонок + "]";
	//		Иначе
	//			МассивКолонок = МассивКолонок + ",";
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	МассивДанных = "[";
	//	Для j = 0 по ТаблицаДанныхИзSQL.Количество()-1 Цикл // 0 по 100 Цикл// 
	//		МассивДанных = МассивДанных + "[";
	//		Для i = 0 по ТаблицаДанныхИзSQL.Колонки.Количество()-1 Цикл
	//			ИмяКолонки = ТаблицаДанныхИзSQL.Колонки[i].Имя;
	//			МассивДанных = МассивДанных + "'" + Вычислить("ТаблицаДанныхИзSQL[j]." + ИмяКолонки) + ?(i = ТаблицаДанныхИзSQL.Колонки.Количество()-1,"'","',");
	//		КонецЦикла;
	//		Если j = ТаблицаДанныхИзSQL.Количество()-1 Тогда //100 Тогда 
	//			МассивДанных = МассивДанных + "]]";
	//		Иначе
	//			МассивДанных = МассивДанных + "],";
	//		КонецЕсли;			
	//	КонецЦикла;
	//КонецЕсли;
	
	СтруктураВозврата.Вставить("МассивКолонок", МассивКолонок);
	СтруктураВозврата.Вставить("МассивДанных", МассивДанных);
	
	Возврат СтруктураВозврата;	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуДанныхИзSQL()
	
	ИмяСервераSQL = "10.2.101.164";
	ПользовательSQL = "odmen";
	ПарольSQL = "123QWEasd";
	БазаДанныхSQL = "Orion";
	
	Подключение = Новый COMОбъект("ADODB.Connection");
	Подключение.ConnectionTimeOut	= 0;
	Подключение.CommandTimeOut	= 0; 
	Подключение.ConnectionString =
	"driver={SQL Server};" +
	"server="+ИмяСервераSQL+";"+
	"uid="+ПользовательSQL+";"+
	"pwd="+ПарольSQL+";"+
	"database="+БазаДанныхSQL+";";
	Подключение.ConnectionTimeout = 30;
	Подключение.CommandTimeout = 600;
	Попытка
		Подключение.Open();
		//Сообщить("Успешное подключение!");
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено ;
	КонецПопытки;
	
	ТекстSQL = "SELECT DISTINCT
	|pLogData.DeviceTime AS Дата,
	|AcessPoint.Name AS Дверь,
	|pLogData.Mode AS Вход1Выход2,
	|pList.Name+' '+pList.FirstName+' '+pList.MidName+' '+pList.TabNumber AS ФИО,
	|PDivision.Name AS Подразделение
	|FROM
	|dbo.pLogData AS pLogData
	|INNER JOIN dbo.pList AS pList
	|ON pLogData.HozOrgan = pList.ID
	|INNER JOIN dbo.AcessPoint AS AcessPoint
	|ON pLogData.DoorIndex = AcessPoint.GIndex
	|INNER JOIN dbo.PDivision AS PDivision
	|ON pList.Section = PDivision.ID
	|WHERE
	|(pLogData.DeviceTime BETWEEN '@DataPar1' AND '@DataPar2')
	|
	|ORDER BY
	|ФИО";
	
	ТекстSQL=СтрЗаменить(ТекстSQL,"@DataPar1",Формат(ДатаНачала,"ДФ=MM.dd.yyyy")+" 00:00:00");
	ТекстSQL=СтрЗаменить(ТекстSQL,"@DataPar2",Формат(ДатаОкончания,"ДФ=MM.dd.yyyy")+" 23:59:59");
	
	СоединениеSQL = Новый COMObject("ADODB.Command");
	СоединениеSQL.ActiveConnection = Подключение;
	СоединениеSQL.NamedParameters = True;
	СоединениеSQL.CommandType = 1;
	СоединениеSQL.CommandText = ТекстSQL; 
	СоединениеSQL.CommandTimeout=60;
	
	ЗаписиSQL = Новый ComObject("ADODB.RecordSet");
	
	ЗаписиSQL = СоединениеSQL.Execute();
	
	ТаблицаТЗ_SQL = Новый ТаблицаЗначений;
	Для НомерСтолбца = 0 По ЗаписиSQL.Fields.Count-1 Цикл 
		ИмяСтолбца =ЗаписиSQL.Fields.Item(НомерСтолбца).Name; 
		ТаблицаТЗ_SQL.Колонки.Добавить(ИмяСтолбца);
	КонецЦикла;
	
	Пока ЗаписиSQL.EOF = 0 Цикл 		
		НоваяСтрока =  ТаблицаТЗ_SQL.Добавить();
		Для НомерСтолбца = 0 По ЗаписиSQL.Fields.Count-1 Цикл
			НоваяСтрока.Установить(НомерСтолбца,ЗаписиSQL.Fields(НомерСтолбца).Value);
		КонецЦикла;
		
		ЗаписиSQL.MoveNext();
		
	КонецЦикла;
	
	ЗаписиSQL.Close();
	Подключение.Close();
	
	Возврат ТаблицаТЗ_SQL;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаНачала = НачалоДня(ТекущаяДата() - 86400);
	ДатаОкончания = КонецДня(ТекущаяДата() - 86400);
КонецПроцедуры
