
&НаКлиенте
Процедура Сформировать(Команда)
	Сообщить("Формирование отчета запущено...");
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ПолучитьТаблицуДанныхИзSQL();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДанныхИзSQL()
	
	ИмяСервераSQL = "10.2.101.164";
	ПользовательSQL = "odmen";
    ПарольSQL = "123QWEasd";
    БазаДанныхSQL = "Orion";
	
	Подключение = Новый COMОбъект("ADODB.Connection");
	Подключение.ConnectionTimeOut	= 0;
	Подключение.CommandTimeOut	= 0; 
	Подключение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
	Подключение.ConnectionTimeout = 30;
	Подключение.CommandTimeout = 600;
	Попытка
		Подключение.Open();
		Сообщить("Успешное подключение!");
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено ;
	КонецПопытки;
	
КонецФункции

